{
  "Header": {
    "Nav": {
      "Home": "Home",
      "Projects": "Projects",
      "About": "About"
    }
  },
  "Home": {
    "Title1": "Software Engineer",
    "Title2": "Playable Developer",
    "Subtitle": "Here you’ll find my projects, results, and interactive experiments. I hope they give you a good sense of my skills as a Software Engineer and Playable Developer."
  },
  "About": {
    "Title": "About",
    "Paragraph1": "I’m a software developer, and my professional journey has led me to the world of playables — interactive and playable ads. Although it may seem like a very specific field, this experience has given me a strong technical foundation to do what I love most: creating digital solutions that deliver value and satisfaction, whether through efficiency or entertainment.",
    "Paragraph2": "I work with technologies such as JavaScript, TypeScript, C++, Python, HTML, CSS, SASS, Tailwind, React, Node.js, Next.js, SQL, NoSQL, Webpack, and WebGL.",
    "Paragraph3": "I believe software represents a new step in the evolution of how humans accomplish tasks, just as stone tools, fire, and steam engines once were in their time. It’s a historical moment that I’m proud to be actively part of. That’s why I strive to be creative and observant, identifying real needs and building products that truly solve them.",
    "Paragraph4": "I’m also deeply interested in game development, especially retro games, and I admire how programmers of past decades created amazing experiences with such limited resources.",
    "Paragraph5": "I’m always open to new projects and collaborations. Feel free to get in touch — I can’t wait to bring new ideas to life and help teams move faster with great tools."
  },
  "Playables": {
    "Title1": "About the project",
    "Title2": "Instructions",
    "Descriptions": {
      "War Machines - Ataque Cidade": "The goal of this project was to remake a classic Playable. The original codebase required some refactoring, as it had been created before the team switched to a new tech stack using TypeScript instead of JavaScript. It was my first time working with the framework’s particle system, and thanks to my teammates’ help, the smoke effect on the building at the end of the main street turned out great. What started as a simple asset replacement evolved into a really fun and rewarding learning experience."
    },
    "AFK Soccer - Chute Forte": "This project was an amazing experience! Since it was one of the new game projects, I had to build it entirely from scratch. I developed the UI so that it could wrap overflowing text correctly in any language and synchronized it with animation triggers. Adjusting the circle when the ball was dragged into the correct spot required some creativity. The most challenging part was the collider — it took a lot of thought, teamwork, and creativity to fix sticking and tunneling bugs. Solving these issues turned into a great learning experience, as I had to study collision mechanics in game development, which helped me a lot in later projects. This was one of the most significant projects I worked on during my internship.",
    "Instructions": {
      "MouseToPlay": "Use the mouse to play it.",
      "TouchToPlay": "Touch the Playable window to play it."
    }
  }
}
