{
  "Header": {
    "Nav": {
      "Home": "Home",
      "Projects": "Projects",
      "About": "About"
    }
  },
  "Home": {
    "Title1": "Software Engineer",
    "Title2": "Playable Developer",
    "Subtitle": "Here you’ll find my projects, results, and interactive experiments. I hope they give you a good sense of my skills as a Software Engineer and Playable Developer."
  },
  "About": {
    "Title": "About",
    "Paragraph1": "I’m a software developer, and my professional journey has led me to the world of playables, interactive and playable ads. Although it may seem like a very specific field, this experience has given me a strong technical foundation to do what I love most: creating digital solutions that deliver value and satisfaction, whether through efficiency or entertainment.",
    "Paragraph2": "I work with technologies such as JavaScript, TypeScript, C++, Python, HTML, CSS, SASS, Tailwind, React, Node.js, Next.js, SQL, NoSQL, Webpack, and WebGL.",
    "Paragraph3": "I believe software represents a new step in the evolution of how humans accomplish tasks, just as stone tools, fire, and steam engines once were in their time. It’s a historical moment that I’m proud to be actively part of. That’s why I strive to be creative and observant, identifying real needs and building products that truly solve them.",
    "Paragraph4": "I’m also deeply interested in game development, especially retro games, and I admire how programmers of past decades created amazing experiences with such limited resources.",
    "Paragraph5": "I’m always open to new projects and collaborations. Feel free to get in touch — I can’t wait to bring new ideas to life and help teams move faster with great tools.",
    "Contact information": "Contact Information"
  },
  "Playables": {
    "Title1": "About the project",
    "Title2": "Instructions",
    "Descriptions": {
      "Zooba - Cinematic Bouncing Shot": "Since this project was inspired by a successful video, a version featuring an additional opening scene was also requested. In the framework used by the team, there was already a class responsible for moving multiple objects based on a “.json” file containing the trajectory positions for each one. After that, to bring the animation to life, I had to trigger the meshes’ animations at the desired moments, using the class functions that executed callbacks at specific times. The result was a stunning animation that plays right before one of the most enjoyable playables I’ve ever created!",
      "Zooba - Bouncing Shot": " This project had no existing foundation, so I had to develop all the code from scratch. The biggest challenge was handling the box collision, since the box was rotated at an angle relative to the axes. To simplify the solution, I transformed the bullet’s position using the box’s rotation angle, allowing the collision test to be performed as if the box were axis-aligned. Another interesting aspect was the technique used to visualize the bullet’s trajectory prediction. To create the visual effect, I used a stretched plane in the direction of a potential collision. Each time the aim changed, a simulated shot calculation returned an array of positions representing the bullet’s path, and from those points, the “line” object was built. Starting a gameplay project completely from scratch was an excellent way to test my knowledge and problem-solving skills. ",
      "Zooba - Cemitério": "The goal was to change the setting of the Playable Resgate Guardas to a Halloween theme. Some assets were redesigned and others were added. Adding the sound effects was the best part. I had already created a way to play SFX in loops with delays in another playable, so I was able to reuse that code. At that time, we developers were already responsible for cutting and editing the audio, so I took the opportunity to explore the excellent software Audacity.",
      "Zooba - Zoom Variations": "The idea here was to add names to the enemies in the  base of Zooba’s battle royale playable, simulating an online match with multiple players. From a coding perspective, the names were added as 3D text objects — normally, we use UI text for that. Each enemy’s name was randomly selected using a random index from an array of names. Much of the implementation reused what had already been done for the visualization of the health bars.",
      "War Machines - Exploits Militar Energy Bar": "This was also a project focused on asset renewal and on testing some features found in a recently successful Playable at the time. The challenge was that, over time, changes caused the scene assets to shift from their original positions, which required extensive refactoring. The highlight of this version is the energy bar, fully functional through a shader that controls how much of the texture is rendered along the X direction based on a percentage parameter.",
      "War Machines - Navio Chopper Xray": "This Playable achieved an important performance metric after its release, being considered a success. For that reason, its features were replicated in several other playables of the franchise. During development, it was necessary to adapt functionalities from previous playables and adjust scene positions that had changed, but everything came together smoothly, resulting in excellent work, especially from the art team. The highlight goes to the X-ray feature, which changes the tint of all objects when zooming in with the scope. Although this could have been implemented differently using shaders, it was a classic trade-off made to meet the project deadline.",
      "War Machines - Ataque Cidade": "The goal of this project was to remake a classic Playable. The original codebase required some refactoring, as it had been created before the team switched to a new tech stack using TypeScript instead of JavaScript. It was my first time working with the framework’s particle system, and thanks to my teammates’ help, the smoke effect on the building at the end of the main street turned out great. What started as a simple asset replacement evolved into a really fun and rewarding learning experience."
    },
    "Sniper 3D - Enemy Shooting": "The idea was to add enemy attacks and looping sound effects. This was the project where I developed a feature to handle looping audio, controlling duration and delay through parameters. The goal was to make this tool reusable for other playables, since it could become a recurring need that wasn’t yet part of our framework. Seeing the final result, with the sounds alternating and blending so effectively with the gameplay, was very rewarding. All of this was achieved with a solid dose of object-oriented programming, use of the Web Audio API, and sound editing in Audacity. The loss of the crosshair when hit by an enemy and the red screen flash indicating damage were decisions I made during development. This illustrates how the well-known “sense of ownership” was a defining trait within the team.",
    "Tennis Clash - Bullseye": "The foundation of this project was very solid, although it still followed the old JavaScript framework pattern. Therefore, a refactor was needed to adapt the typing to TypeScript. The most challenging part was adjusting the movement code used in an older character asset to work properly with the new one. The highlight goes to the gameplay, where the interval between throws decreases as the number of hits increases, and to the user feedback texts, which turned out beautifully.",
    "Tennis Clash - Night Crowd": "This was another case of adapting an old base using a different framework pattern and modified scene positions. The result turned out great and visually appealing. It was a brilliant idea from the creative team to add scripted gameplay in a nighttime environment. This was one of the first Playables I worked on during my internship.",
    "Tennis Clash - Paredao": "The biggest challenge here was to constantly update the wall colliders, as the wall gradually lost pieces over time. This was done as follows: objects representing polygons, defined by their vertices, were added to an array that stored the “holes” in the wall. Therefore, if the ball was inside one of these polygons while passing through the wall, it would go straight through. Working with games brings not only programming challenges but also mathematical ones.",
    "Tennis Clash - Aim and Shoot": "This is an example of how creativity was essential in the work. The idea was to combine the gameplay of two different playable franchises. After merging the distinct code bases, it was necessary to add a new feature: randomizing the target positions between the corners of the goal. The impact animation was created using concepts of simple harmonic motion.",
    "Time Blast - Vertical Puzzle": "This is one of my favorites. The art team did an amazing job, and it was only fair that I delivered code to match their work. At that time, a tool developed by a team member allowed the creative directors to modify variable values in the playables, creating their own combinations. I decided to make the puzzle sequence customizable, so the order and number of puzzles were controlled by an array. The final puzzle, regardless of its type, would always present the reward with the treasure chest. This was achieved through polymorphism in the base puzzle functions, with each specific behavior added in derived classes. During gameplay, when the last position of the array was reached — meaning the last puzzle — it was loaded as a parameter into a PrizePuzzle class, allowing any puzzle to become a prize puzzle. Creating the translation, rotation, and scale animations, as well as synchronizing the sprite animations, was both fun and deeply satisfying.",
    "Time Blast - Tile Sequence": "This project already had a solid and well-established foundation. My role here was to add sound and change the user input so that the player would select a sequence instead of simply tapping regions with more than two neighboring objects. The highlight goes to the sound loop. As mentioned in other projects, the developers on the team were responsible for editing the sound effects for their own playables, and I was particularly pleased with the result of the background music in this one.",
    "AFK Soccer - Chute Forte": "This project was an amazing experience! Since it was one of the new game projects, I had to build it entirely from scratch. I developed the UI so that it could wrap overflowing text correctly in any language and synchronized it with animation triggers. Adjusting the circle when the ball was dragged into the correct spot required some creativity. The most challenging part was the collider — it took a lot of thought, teamwork, and creativity to fix sticking and tunneling bugs. Solving these issues turned into a great learning experience, as I had to study collision mechanics in game development, which helped me a lot in later projects. This was one of the most significant projects I worked on during my internship.",
    "Instructions": {
      "MouseToPlay": "Use the mouse to play it.",
      "SpaceToShoot": "Press space key to shoot.",
      "TouchToPlay": "Touch the Playable window to play it."
    }
  }
}
