{
  "Header": {
    "Nav": {
      "Home": "Início",
      "Projects": "Projetos",
      "About": "Sobre"
    }
  },
  "Home": {
    "Title1": "Engenheiro de Software",
    "Title2": "Desenvolvedor de Playable",
    "Subtitle": "Aqui você encontrará meus projetos e seus resultados. Espero que eles transmitam minhas habilidades como Engenheiro de Software e Desenvolvedor de Playables."
  },
  "About": {
    "Title": "Sobre",
    "Paragraph1": "Sou desenvolvedor de software e minha trajetória profissional me levou ao universo dos playables, anúncios interativos e jogáveis. Embora pareça um campo bastante específico, essa experiência me proporcionou uma base técnica sólida para fazer o que mais gosto: criar soluções digitais que entreguem valor e satisfação, seja pela eficiência ou pelo entretenimento.",
    "Paragraph2": "Utilizo tecnologias como JavaScript, TypeScript, C++, Python, HTML, CSS, SASS, Tailwind, React, Node.js, Next.js, SQL, NoSQL, Webpack e WebGL.",
    "Paragraph3": " Acredito que o software representa um novo passo na evolução de como os seres humanos realizam tarefas, assim como foram as ferramentas de pedra lascada, o fogo e as máquinas a vapor em seus tempos. É um momento histórico do qual tenho orgulho de fazer parte ativamente. Por isso, busco ser criativo e observador para entender necessidades reais e criar produtos que realmente as resolvam. ",
    "Paragraph4": "Também tenho grande interesse pelo desenvolvimento de jogos, especialmente retrô games, pela engenhosidade com que programadores de outras épocas criaram experiências incríveis com recursos limitados.",
    "Paragraph5": " Estou sempre aberto a novos projetos e colaborações. Sinta-se à vontade para entrar em contato. Mal posso esperar para dar vida a novas ideias e ajudar equipes a se moverem mais rápido com ferramentas incríveis. ",
    "Contact information": "Informações de Contato"
  },
  "Playables": {
    "Title1": "Sobre o projeto",
    "Title2": "Instruções",
    "Descriptions": {
      "Zooba - Cinematic Bouncing Shot": "Como esse projeto foi inspirado em um vídeo de sucesso, também foi solicitada uma versão com a adição de uma cena inicial. No framework utilizado pela equipe, já existia uma classe responsável por mover múltiplos objetos a partir de um arquivo “.json” contendo as posições da trajetória de cada um. Depois disso, para dar vida à animação, precisei disparar as animações das meshes nos momentos desejados, utilizando as funções dessa classe que executavam callbacks em tempos específicos. O resultado foi uma animação incrível que antecede um dos playables mais divertidos que já desenvolvi!",
      "Zooba - Bouncing Shot": "Esse projeto não possuía nenhuma base prévia, portanto precisei desenvolver todo o código do zero. A maior dificuldade foi lidar com a colisão da caixa, já que ela possuía um ângulo em relação aos eixos. Para facilitar a solução, transformei a posição da bala utilizando o ângulo da caixa, de modo que o teste de colisão pudesse ser feito como se a caixa estivesse alinhada aos eixos. Outro aspecto muito interessante foi a técnica usada para mostrar a previsão da trajetória da bala. Para criar o efeito visual, utilizei um plano estendido na direção de uma possível colisão. Assim, a cada mudança na mira, um cálculo simulando o disparo retornava um array com posições representando a trajetória da bala, a partir desses pontos, o objeto “linha” era construído. Começar um projeto de gameplay completamente do zero foi uma excelente forma de testar meus conhecimentos e minha capacidade de encontrar soluções criativas. ",
      "Zooba - Cemitério": "O objetivo era alterar a ambientação do Playable Resgate Guardas para o tema de Halloween. Alguns assets foram reformulados e outros adicionados. A parte mais divertida foi incluir os efeitos sonoros. Eu já havia criado anteriormente um sistema para reproduzir SFX em loop com delay em outro playable, então bastou reaproveitar esse código. Nessa época, nós desenvolvedores já éramos responsáveis pelo recorte e edição dos áudios, e foi quando me aventurei no excelente software Audacity.",
      "Zooba - Zoom Variations": "A ideia aqui foi adicionar nomes aos inimigos na base do playable battle royale de Zooba, simulando uma partida online com vários jogadores. Em termos de código, o que foi feito foi adicionar o texto dos nomes como objetos 3D — normalmente utilizamos texto em UI. Para isso, o nome de cada inimigo foi sorteado a partir de um índice aleatório em um array de nomes. Grande parte da implementação reaproveitou o que já havia sido feito para a visualização das barras de energia.",
      "War Machines - Ataque Cidade": "O objetivo deste projeto foi refazer um Playable clássico. A base de código precisou de uma refatoração, já que havia sido criada antes da equipe mudar a stack de desenvolvimento para TypeScript em vez de JavaScript. Foi a minha primeira vez utilizando o sistema de partículas do framework, e graças à ajuda dos meus colegas, o efeito de fumaça no prédio no final da rua principal ficou excelente. O que começou como uma simples troca de assets acabou se tornando uma experiência de aprendizado divertida e gratificante.",
      "War Machines - Navio Chopper Xray": " Este Playable alcançou uma métrica importante nos resultados após seu lançamento, sendo considerado um sucesso. Por esse motivo, suas features foram reproduzidas em diversos outros playables da franquia. Durante o desenvolvimento, foi necessário adaptar funcionalidades de playables anteriores e ajustar posições de cenário que haviam mudado, mas tudo se encaixou de forma satisfatória, resultando em um excelente trabalho, especialmente por parte do time de arte. O destaque vai para a feature de raio X, que altera o tint de todos os objetos quando ocorre o zoom na mira. Isso poderia ter sido feito de outra forma, utilizando shaders, mas foi um caso clássico de trade-off para atender ao prazo estabelecido. ",
      "War Machines - Exploits Militar Energy Bar": "Este também foi um projeto de renovação de assets e de testes de algumas funcionalidades presentes em um Playable de sucesso recente na época. A questão é que, com as mudanças ocorridas ao longo do tempo, os assets do cenário passaram a ocupar posições diferentes dos originais, o que exigiu uma grande refatoração. O destaque desta versão vai para a barra de energia, totalmente funcional por meio de um shader que controla quanto da textura será renderizado na direção X, com base em um parâmetro de porcentagem",
      "Sniper 3D - Enemy Shooting": "A ideia era adicionar o ataque do inimigo e efeitos sonoros em loop. Foi nesse projeto que desenvolvi uma feature para lidar com áudios em loop, controlando o tempo de duração e o delay por meio de parâmetros. O objetivo era tornar essa ferramenta reutilizável em outros playables, já que futuramente poderia ser algo recorrente e ainda não existia em nossa base. Foi muito satisfatório ver o resultado final, com os áudios se alternando e combinando de forma intensa com a situação da gameplay. Tudo isso foi alcançado com uma boa dose de orientação a objetos, uso da Web Audio API e edição de sons no Audacity. A perda da mira quando o jogador é atingido pelo inimigo e o piscar em vermelho da tela para representar dano foram decisões que tomei durante o desenvolvimento. Isso demonstra como o famoso “sentimento de dono” era uma marca presente no time.",
      "Tennis Clash - Bullseye": "A base desse projeto estava muito boa, embora ainda seguisse o padrão antigo do framework em JavaScript. Por isso, foi necessária uma refatoração para adaptar a tipagem ao TypeScript. A parte mais desafiadora foi ajustar o código de movimentação usado em um asset de personagem mais antigo para que funcionasse corretamente com o novo. O destaque fica para a gameplay, em que o intervalo entre lançamentos diminui conforme o número de acertos, e para os textos de feedback ao usuário, que ficaram muito bem elaborados.",
      "Tennis Clash - Night Crowd": "Esse também foi um caso de adaptação de uma base antiga, utilizando um padrão de framework diferente e com posições de cenário modificadas. O resultado ficou muito bom e visualmente bonito. Foi uma ótima ideia do time de criação adicionar a gameplay roteirizada em um ambiente noturno. Este foi um dos primeiros Playables que desenvolvi durante o estágio.",
      "Tennis Clash - Paredao": "O maior desafio aqui foi reformular constantemente os colisores da parede, já que ela ia perdendo pedaços aos poucos. Isso foi feito da seguinte forma: objetos que representavam polígonos, definidos por seus vértices, eram adicionados a um array que armazenava os “buracos” na parede. Assim, caso a bola estivesse dentro desses polígonos durante a passagem pela parede, ela atravessava livremente. Trabalhar com jogos traz desafios não apenas de programação, mas também matemáticos.",
      "Tennis Clash - Aim and Shoot": "Este é um exemplo de como a criatividade era essencial no trabalho. A ideia era combinar a gameplay de duas franquias de playables diferentes. Após unir as bases de código distintas, foi necessário acrescentar um elemento novo: a aleatorização da posição dos alvos entre os cantos do gol. A animação de impacto foi criada utilizando conceitos de movimento harmônico simples.",
      "Time Blast - Tile Sequence": "Este projeto já possuía uma base pronta e bem consolidada. Minha função aqui foi adicionar o som e alterar o input do usuário para que ele selecionasse uma sequência, em vez de apenas tocar em regiões com mais de dois objetos vizinhos. O destaque vai para o loop sonoro. Como mencionado em outros projetos, os desenvolvedores do time ficaram responsáveis por editar os efeitos sonoros de seus próprios playables, e eu particularmente gostei muito do resultado da música de fundo neste caso.",
      "Time Blast - Vertical Puzzle": "Este é um dos meus favoritos. O time de arte fez um trabalho incrível, e nada mais justo do que eu entregar um código à altura. Nessa época, havia uma ferramenta criada por um membro da equipe que permitia aos diretores de criação alterar valores de variáveis dos playables, criando suas próprias combinações. Decidi, então, deixar a sequência de puzzles customizável, de forma que a sucessão e a quantidade deles fossem controladas por um array. O puzzle final, independentemente do tipo, sempre trazia o prêmio com o baú. Isso foi implementado utilizando polimorfismo nas funções base dos puzzles e adicionando as funções específicas de cada tipo em classes derivadas. Durante a gameplay, quando a última posição do array era alcançada — ou seja, o último puzzle —, ele era carregado como parâmetro em uma classe PrizePuzzle, tornando possível que qualquer puzzle se transformasse em um puzzle de prêmio. Foi muito divertido e gratificante criar as animações de translação, rotação e escala, além de sincronizar as animações dos sprites.",
      "AFK Soccer - Chute Forte": "Esse projeto foi uma experiência incrível! Como era um dos novos jogos, precisei construí-lo totalmente do zero. Desenvolvi a interface para que o texto fosse ajustado corretamente em qualquer idioma e sincronizado com as animações. Ajustar o círculo quando a bola era arrastada para o espaço correto exigiu um pouco de criatividade. A parte mais desafiadora foi o colisor — foi necessário muito raciocínio, colaboração e criatividade para corrigir os bugs de “sticking” e “tunneling”. Resolver esses problemas se tornou um ótimo aprendizado, pois precisei estudar sobre colisões em desenvolvimento de jogos, o que me ajudou bastante em projetos futuros. Esse foi um dos projetos mais importantes em que trabalhei durante meu período de estágio."
    },
    "Instructions": {
      "MouseToPlay": "Use o mouse para jogar.",
      "SpaceToShoot": "Use a barra de espaço para atirar.",
      "TouchToPlay": "Toque a janela do Playable para jogar."
    }
  }
}
