{
  "Header": {
    "Nav": {
      "Home": "Início",
      "Projects": "Projetos",
      "About": "Sobre"
    }
  },
  "Home": {
    "Title1": "Engenheiro de Software",
    "Title2": "Desenvolvedor de Playable",
    "Subtitle": "Aqui você encontrará meus projetos e seus resultados. Espero que eles transmitam minhas habilidades como Engenheiro de Software e Desenvolvedor de Playables."
  },
  "About": {
    "Title": "Sobre",
    "Paragraph1": "Sou desenvolvedor de software e minha trajetória profissional me levou ao universo dos playables, anúncios interativos e jogáveis. Embora pareça um campo bastante específico, essa experiência me proporcionou uma base técnica sólida para fazer o que mais gosto: criar soluções digitais que entreguem valor e satisfação, seja pela eficiência ou pelo entretenimento.",
    "Paragraph2": "Utilizo tecnologias como JavaScript, TypeScript, C++, Python, HTML, CSS, SASS, Tailwind, React, Node.js, Next.js, SQL, NoSQL, Webpack e WebGL.",
    "Paragraph3": " Acredito que o software representa um novo passo na evolução de como os seres humanos realizam tarefas, assim como foram as ferramentas de pedra lascada, o fogo e as máquinas a vapor em seus tempos. É um momento histórico do qual tenho orgulho de fazer parte ativamente. Por isso, busco ser criativo e observador para entender necessidades reais e criar produtos que realmente as resolvam. ",
    "Paragraph4": "Também tenho grande interesse pelo desenvolvimento de jogos, especialmente retrô games, pela engenhosidade com que programadores de outras épocas criaram experiências incríveis com recursos limitados.",
    "Paragraph5": " Estou sempre aberto a novos projetos e colaborações. Sinta-se à vontade para entrar em contato. Mal posso esperar para dar vida a novas ideias e ajudar equipes a se moverem mais rápido com ferramentas incríveis. ",
    "Contact information": "Informações de Contato"
  },
  "Playables": {
    "Title1": "Sobre o projeto",
    "Title2": "Instruções",
    "Descriptions": {
      "Placeholder": "É só uma página para ficar no lugar dos projetos de playables."
    },
    "Instructions": {
      "MouseToPlay": "Use o mouse para jogar.",
      "SpaceToShoot": "Use a barra de espaço para atirar.",
      "TouchToPlay": "Toque a janela do Playable para jogar."
    }
  }
}
